export class RoleModelData {
	static AttrType = {
		1: "Hp", //生命
		2: "Atk", //攻击
		3: "Def", //防御
		4: "Hit", //命中(万分比)
		5: "Avd", //闪避(万分比)
		6: "Cri", //暴击(万分比)
		7: "ACri", //防暴击(万分比)
		8: "Speed", //速度
		9: "Atk1", //无视防御
		10: "Def1", //减免无视
		11: "Atk2", //伤害加深
		12: "Def2", //伤害减少
		13: "Atk3", //伤害增加%
		14: "Def3", //伤害减少%
		15: "Atk4", //暴击伤害增加
		16: "Def4", //暴击伤害减少
		17: "Atk5", //魂概率增加
		18: "Def5", //魂概率减少
		19: "Atk6", //PVP伤害增加(万分比)
		20: "Def6", //PVP伤害减少(万分比)
		21: "Atk7", //PVE伤害增加(万分比)
		22: "Def7", //PVE伤害减少(万分比)
		23: "ExtraHurt", //额外伤害
		24: "Atk8", //PVE首领伤害增加万分比
		51: "Hp_P", //生命
		52: "Atk_P", //攻击
		53: "Def_P", //防御
		54: "Hit_P", //命中(万分比)
		55: "Avd_P", //闪避(万分比)
		56: "Cri_P", //暴击(万分比)
		57: "ACri_P", //防暴击(万分比)
		58: "Speed_P", //速度
		59: "Atk1_P", //无视防御
		60: "Def1_P", //减免无视
		61: "Atk2_P", //伤害加深
		62: "Def2_P", //伤害减少
		63: "Atk3_P", //伤害增加%
		64: "Def3_P", //伤害减少%
		65: "Atk4_P", //暴击伤害增加
		66: "Def4_P", //暴击伤害减少
		67: "Atk5_P", //魂概率增加
		68: "Def5_P", //魂概率减少
		69: "Atk6_P", //PVP伤害增加(万分比)
		70: "Def6_P", //PVP伤害减少(万分比)
		71: "Atk7_P", //PVE伤害增加(万分比)
		72: "Def7_P", //PVE伤害减少(万分比)
		100: "UserId", //用户编号,纯客户端用户
		101: "Coin1", //金币(银元宝)
		102: "Coin2", //绑定金币（没有用）
		103: "Coin3", //仙玉
		104: "Level", //等级
		105: "Exp", //经验
		106: "Nick", //昵称
		107: "Sex", //性别
		108: "LoginAreaId", //登录区编号
	}
	
	/*
	* 生命
	*/
	Hp = 0; 
	/*
	* 攻击
	*/
	Atk = 0; 
	/*
	* 防御
	*/
	Def = 0; 
	/*
	* 命中(万分比)
	*/
	Hit = 0; 
	/*
	* 闪避(万分比)
	*/
	Avd = 0; 
	/*
	* 暴击(万分比)
	*/
	Cri = 0; 
	/*
	* 防暴击(万分比)
	*/
	ACri = 0; 
	/*
	* 速度
	*/
	Speed = 0; 
	/*
	* 无视防御
	*/
	Atk1 = 0; 
	/*
	* 减免无视
	*/
	Def1 = 0; 
	/*
	* 伤害加深
	*/
	Atk2 = 0; 
	/*
	* 伤害减少
	*/
	Def2 = 0; 
	/*
	* 伤害增加%
	*/
	Atk3 = 0; 
	/*
	* 伤害减少%
	*/
	Def3 = 0; 
	/*
	* 暴击伤害增加
	*/
	Atk4 = 0; 
	/*
	* 暴击伤害减少
	*/
	Def4 = 0; 
	/*
	* 魂概率增加
	*/
	Atk5 = 0; 
	/*
	* 魂概率减少
	*/
	Def5 = 0; 
	/*
	* PVP伤害增加(万分比)
	*/
	Atk6 = 0; 
	/*
	* PVP伤害减少(万分比)
	*/
	Def6 = 0; 
	/*
	* PVE伤害增加(万分比)
	*/
	Atk7 = 0; 
	/*
	* PVE伤害减少(万分比)
	*/
	Def7 = 0; 
	/*
	* 额外伤害
	*/
	ExtraHurt = 0; 
	/*
	* PVE首领伤害增加万分比
	*/
	Atk8 = 0; 
	/*
	* 生命
	*/
	Hp_P = 0; 
	/*
	* 攻击
	*/
	Atk_P = 0; 
	/*
	* 防御
	*/
	Def_P = 0; 
	/*
	* 命中(万分比)
	*/
	Hit_P = 0; 
	/*
	* 闪避(万分比)
	*/
	Avd_P = 0; 
	/*
	* 暴击(万分比)
	*/
	Cri_P = 0; 
	/*
	* 防暴击(万分比)
	*/
	ACri_P = 0; 
	/*
	* 速度
	*/
	Speed_P = 0; 
	/*
	* 无视防御
	*/
	Atk1_P = 0; 
	/*
	* 减免无视
	*/
	Def1_P = 0; 
	/*
	* 伤害加深
	*/
	Atk2_P = 0; 
	/*
	* 伤害减少
	*/
	Def2_P = 0; 
	/*
	* 伤害增加%
	*/
	Atk3_P = 0; 
	/*
	* 伤害减少%
	*/
	Def3_P = 0; 
	/*
	* 暴击伤害增加
	*/
	Atk4_P = 0; 
	/*
	* 暴击伤害减少
	*/
	Def4_P = 0; 
	/*
	* 魂概率增加
	*/
	Atk5_P = 0; 
	/*
	* 魂概率减少
	*/
	Def5_P = 0; 
	/*
	* PVP伤害增加(万分比)
	*/
	Atk6_P = 0; 
	/*
	* PVP伤害减少(万分比)
	*/
	Def6_P = 0; 
	/*
	* PVE伤害增加(万分比)
	*/
	Atk7_P = 0; 
	/*
	* PVE伤害减少(万分比)
	*/
	Def7_P = 0; 
	/*
	* 用户编号,纯客户端用户
	*/
	UserId = 0; 
	/*
	* 金币(银元宝)
	*/
	Coin1 = 0; 
	/*
	* 绑定金币（没有用）
	*/
	Coin2 = 0; 
	/*
	* 仙玉
	*/
	Coin3 = 0; 
	/*
	* 等级
	*/
	Level = 0; 
	/*
	* 经验
	*/
	Exp = 0; 
	/*
	* 昵称
	*/
	Nick = ""; 
	/*
	* 性别
	*/
	Sex = 0; 
	/*
	* 登录区编号
	*/
	LoginAreaId = 0; 
}
